# GridlineAxisTooClose Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridFailures..::..GridlineAxisTooClose Property
BuiltInFailures..::..GridFailures Class See Also
---
Axis of gridlines should not change order or be closer than [Value] to each other.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridlineAxisTooClose { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridlineAxisTooClose As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridlineAxisTooClose {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GridFailures Class
Autodesk.Revit.DB Namespace